artifacts/bench/20260421T125704Z/smoke/stdout.txt
Unable to find image 'grafana/k6:0.51.0' locally
0.51.0: Pulling from grafana/k6
4f4fb700ef54: Pulling fs layer
619be1103602: Pulling fs layer
89315296fd5a: Pulling fs layer
d5f704ced18e: Pulling fs layer
4f4fb700ef54: Already exists
4f4fb700ef54: Pull complete
619be1103602: Download complete
89315296fd5a: Download complete
619be1103602: Pull complete
89315296fd5a: Pull complete
d5f704ced18e: Download complete
d5f704ced18e: Pull complete
3e4bcd9ff1bd: Download complete
Digest: sha256:b2de44f593444feca8c66e7ee8cd230b272f614a7d7b2e784e7b76569c00fbf7
Status: Downloaded newer image for grafana/k6:0.51.0

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/main.js
        output: -

     scenarios: (100.00%) 1 scenario, 400 max VUs, 1m0s max duration (incl. graceful stop):
              * main: 200.00 iterations/s for 30s (maxVUs: 50-400, exec: run, gracefulStop: 30s)


running (0m01.0s), 011/050 VUs, 189 complete and 0 interrupted iterations
main   [   3% ] 011/050 VUs  01.0s/30s  200.00 iters/s

running (0m02.0s), 011/050 VUs, 389 complete and 0 interrupted iterations
main   [   7% ] 011/050 VUs  02.0s/30s  200.00 iters/s

running (0m03.0s), 012/050 VUs, 588 complete and 0 interrupted iterations
main   [  10% ] 012/050 VUs  03.0s/30s  200.00 iters/s

running (0m04.0s), 012/050 VUs, 788 complete and 0 interrupted iterations
main   [  13% ] 012/050 VUs  04.0s/30s  200.00 iters/s

running (0m05.0s), 012/050 VUs, 988 complete and 0 interrupted iterations
main   [  17% ] 012/050 VUs  05.0s/30s  200.00 iters/s

running (0m06.0s), 011/050 VUs, 1189 complete and 0 interrupted iterations
main   [  20% ] 011/050 VUs  06.0s/30s  200.00 iters/s

running (0m07.0s), 012/050 VUs, 1388 complete and 0 interrupted iterations
main   [  23% ] 012/050 VUs  07.0s/30s  200.00 iters/s

running (0m08.0s), 012/050 VUs, 1588 complete and 0 interrupted iterations
main   [  27% ] 012/050 VUs  08.0s/30s  200.00 iters/s

running (0m09.0s), 012/050 VUs, 1788 complete and 0 interrupted iterations
main   [  30% ] 012/050 VUs  09.0s/30s  200.00 iters/s

running (0m10.0s), 011/050 VUs, 1988 complete and 0 interrupted iterations
main   [  33% ] 011/050 VUs  10.0s/30s  200.00 iters/s

running (0m11.0s), 011/050 VUs, 2189 complete and 0 interrupted iterations
main   [  37% ] 011/050 VUs  11.0s/30s  200.00 iters/s

running (0m12.0s), 012/050 VUs, 2388 complete and 0 interrupted iterations
main   [  40% ] 012/050 VUs  12.0s/30s  200.00 iters/s

running (0m13.0s), 011/050 VUs, 2589 complete and 0 interrupted iterations
main   [  43% ] 011/050 VUs  13.0s/30s  200.00 iters/s

running (0m14.0s), 012/050 VUs, 2788 complete and 0 interrupted iterations
main   [  47% ] 012/050 VUs  14.0s/30s  200.00 iters/s

running (0m15.0s), 011/050 VUs, 2989 complete and 0 interrupted iterations
main   [  50% ] 011/050 VUs  15.0s/30s  200.00 iters/s

running (0m16.0s), 011/050 VUs, 3189 complete and 0 interrupted iterations
main   [  53% ] 011/050 VUs  16.0s/30s  200.00 iters/s

running (0m17.0s), 012/050 VUs, 3388 complete and 0 interrupted iterations
main   [  57% ] 012/050 VUs  17.0s/30s  200.00 iters/s

running (0m18.0s), 011/050 VUs, 3589 complete and 0 interrupted iterations
main   [  60% ] 011/050 VUs  18.0s/30s  200.00 iters/s

running (0m19.0s), 011/050 VUs, 3789 complete and 0 interrupted iterations
main   [  63% ] 011/050 VUs  19.0s/30s  200.00 iters/s

running (0m20.0s), 012/050 VUs, 3988 complete and 0 interrupted iterations
main   [  67% ] 012/050 VUs  20.0s/30s  200.00 iters/s

running (0m21.0s), 011/050 VUs, 4189 complete and 0 interrupted iterations
main   [  70% ] 011/050 VUs  21.0s/30s  200.00 iters/s

running (0m22.0s), 011/050 VUs, 4389 complete and 0 interrupted iterations
main   [  73% ] 011/050 VUs  22.0s/30s  200.00 iters/s

running (0m23.0s), 011/050 VUs, 4589 complete and 0 interrupted iterations
main   [  77% ] 011/050 VUs  23.0s/30s  200.00 iters/s

running (0m24.0s), 012/050 VUs, 4788 complete and 0 interrupted iterations
main   [  80% ] 012/050 VUs  24.0s/30s  200.00 iters/s

running (0m25.0s), 011/050 VUs, 4989 complete and 0 interrupted iterations
main   [  83% ] 011/050 VUs  25.0s/30s  200.00 iters/s

running (0m26.0s), 011/050 VUs, 5189 complete and 0 interrupted iterations
main   [  87% ] 011/050 VUs  26.0s/30s  200.00 iters/s

running (0m27.0s), 012/050 VUs, 5388 complete and 0 interrupted iterations
main   [  90% ] 012/050 VUs  27.0s/30s  200.00 iters/s

running (0m28.0s), 011/050 VUs, 5589 complete and 0 interrupted iterations
main   [  93% ] 011/050 VUs  28.0s/30s  200.00 iters/s

running (0m29.0s), 011/050 VUs, 5789 complete and 0 interrupted iterations
main   [  97% ] 011/050 VUs  29.0s/30s  200.00 iters/s

running (0m30.0s), 011/050 VUs, 5989 complete and 0 interrupted iterations
main   [ 100% ] 011/050 VUs  30.0s/30s  200.00 iters/s
time="2026-04-21T12:57:37Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/out/summary.json': open /out/summary.json: permission denied"

     ✗ hot feed 200
      ↳  0% — ✓ 0 / ✗ 6000
     ✗ get post 200
      ↳  0% — ✓ 0 / ✗ 6000
     ✓ create post 201

     checks.........................: 33.33% ✓ 6000       ✗ 12000
     data_received..................: 5.3 MB 178 kB/s
     data_sent......................: 3.8 MB 128 kB/s
     http_req_blocked...............: avg=3.81µs  min=1.11µs   med=2.58µs  max=347.67µs p(90)=5.02µs  p(95)=5.4µs  
     http_req_connecting............: avg=386ns   min=0s       med=0s      max=259.02µs p(90)=0s      p(95)=0s     
   ✓ http_req_duration..............: avg=1.63ms  min=864.1µs  med=1.32ms  max=10.19ms  p(90)=2.53ms  p(95)=2.66ms 
       { expected_response:true }...: avg=2.43ms  min=1.85ms   med=2.41ms  max=10.19ms  p(90)=2.72ms  p(95)=2.84ms 
   ✗ http_req_failed................: 66.66% ✓ 12000      ✗ 6000 
     http_req_receiving.............: avg=57.6µs  min=18.11µs  med=54.67µs max=331.6µs  p(90)=75.2µs  p(95)=90.33µs
     http_req_sending...............: avg=18.47µs min=6.39µs   med=18.63µs max=468.62µs p(90)=24.81µs p(95)=27.88µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=1.56ms  min=799.87µs med=1.24ms  max=9.65ms   p(90)=2.44ms  p(95)=2.58ms 
     http_reqs......................: 18000  598.978631/s
     iteration_duration.............: avg=55.77ms min=54.36ms  med=55.69ms max=64.11ms  p(90)=56.46ms p(95)=56.75ms
     iterations.....................: 6000   199.659544/s
     vus............................: 11     min=11       max=12 
     vus_max........................: 50     min=50       max=50 


running (0m30.1s), 000/050 VUs, 6000 complete and 0 interrupted iterations
main ✓ [ 100% ] 000/050 VUs  30s  200.00 iters/s
time="2026-04-21T12:57:37Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"